CommunityGD32Cores/gigadevice-firmware-and-docs/GD32E50x/GD32E50x_AddOn_V1.3.0/GigaDevice.GD32E50x_DFP.1.3.0/GigaDevice.GD32E50x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>http://gd32mcu.21ic.com/data/documents/yingyongruanjian/</url>
  <name>GD32E50x_DFP</name>
  <description>GigaDevice GD32E50x Series Device Support and Examples</description>
  <releases>
 <release version="1.3.0" date="2020-12-22">
    Add the CAN module and GD32E508.
  </release>
 <release version="1.2.0" date="2020-12-22">
    Delete the usart5 hardware flow control.
  </release>
 <release version="1.1.0" date="2020-08-27">
    Delete the CAN module.
  </release>
  <release version="1.0.1" date="2020-08-18">
    Modify the size of algorithm and open DSP.
  </release>
  <release version="1.0.0" date="2020-04-01">
    First Release version of GD32E50x Device Family Pack.
  </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32E50x</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32E50x Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M33"  Dmpu="1" Ddsp="DSP" Dfpu="1" Dendian="Little-endian" />
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M33 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>
      <feature type="XTAL"               n="4000000"  m="32000000"  name="Crystal Oscillator"/>
      <feature type="CoreOther"       n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"               n="9"                                         name="General Purpose DMA with Centralized FIFO and Burst Support"/>
      <feature type="IntRC"              n="8000000"                           name="Internal 8M RC oscillator"/>
      <feature type="IntRC"              n="28000000"                           name="Internal 28M RC oscillator"/>      
      <feature type="RTC"                n="32000"                                 name="RTC with 32 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                 n="3"                                         name="Internal PLL"/>
      <feature type="PowerMode"    n="4"                                          name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"    n="4"                                          name="POR, PDR, LVD, and BPOR"/>
      <feature type="ExtInt"             n="25"                                        name="External interrupt"/>            
      <feature type="Temp"             n="-40"          m="85"                name="Extended Operating Temperature Range"/>
      <feature type="ADC"               n="1"              m="18"                name="High-Performance ADC"/>
      <feature type="Timer"             n="1"              m="32"                name="32-bit General Purpose Timer"/>
      <feature type="Timer"             n="5"              m="16"                name="16-bit General Purpose Timer"/>
      <feature type="Timer"             n="1"              m="16"                name="Advanced Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Basic Timer"/>
      <feature type="Timer"             n="1"              m="24"                name="SysTick Timer"/>
      <feature type="WDT"               n="2"                                          name="Watchdog timer"/>
      <feature type="MPSerial"         n="4"                                          name="Multi-Purpose Serial Interface Module: I2C, I2S, SPI, USART"/> 
      <feature type="USART"            n="2"              m="12500000"    name="High-Speed USART Interface"/>
      <feature type="IOs"                 n="112"                                       name="IO pins"/>
      <feature type="I2C"                 n="3"                                           name="Low-Power I2C"/>
      <feature type="SPI"                  n="3"                                          name="SPI Interface"/>
      <feature type="I2S"                  n="2"                                          name="I2S Interface"  />
      <feature type="VCC"                n="1.8"                m="3.6"          name="Voltage"/>
  
<!-- ************************  Subfamily 'GD32E503'  **************************** -->
      <subFamily DsubFamily="GD32E503">
        <processor Dclock="180000000"/>
        <description>
        GD32E50x - ARM Cortex-M33 Core
          Frequency up to 180 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 256KB to 512KB
          SRAM size from 96 KB to 128KB with HW parity checking
          3KB ISP loader ROM
        </description>
        <!-- *************************  Device 'GD32E503CC'  ***************************** -->
        <device Dname="GD32E503CC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32E503CE'  ***************************** -->
        <device Dname="GD32E503CE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32E503RC'  ***************************** -->
        <device Dname="GD32E503RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32E503RE'  ***************************** -->
        <device Dname="GD32E503RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

