CommunityGD32Cores/gigadevice-firmware-and-docs/GD32E50x/GD32E50x_AddOn_V1.3.0/GigaDevice.GD32E50x_DFP.1.3.0/GigaDevice.GD32E50x_DFP.pdsc
        <!-- *************************  Device 'GD32E503VC'  ***************************** -->
        <device Dname="GD32E503VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32E503VE'  ***************************** -->
        <device Dname="GD32E503VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32E503ZC'  ***************************** -->
        <device Dname="GD32E503ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32E503ZE'  ***************************** -->
        <device Dname="GD32E503ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_HD"/>
          <debug svd="SVD/GD32E50x_HD.svd"/>
        </device>

      </subFamily>
     
 <!-- ************************  Subfamily 'GD32E505'  **************************** -->
      <subFamily DsubFamily="GD32E505">
        <processor Dclock="180000000"/>
        <description>
        GD32E50x - ARM Cortex-M33 Core
          Frequency up to 180 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 128KB to 512KB
          SRAM size from 80 KB to 128K with HW parity checking
          3KB ISP loader ROM
        </description>
        <!-- *************************  Device 'GD32E505RB'  ***************************** -->
        <device Dname="GD32E505RB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x14000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_128.FLM" start="0x08000000" size="0x020000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E505RC'  ***************************** -->
        <device Dname="GD32E505RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E505RE'  ***************************** -->
        <device Dname="GD32E505RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E505VC'  ***************************** -->
        <device Dname="GD32E505VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E505VE'  ***************************** -->
        <device Dname="GD32E505VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E505ZC'  ***************************** -->
        <device Dname="GD32E505ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E505ZE'  ***************************** -->
        <device Dname="GD32E505ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

      </subFamily>

