CommunityGD32Cores/gigadevice-firmware-and-docs/GD32E50x/GD32E50x_AddOn_V1.3.0/GigaDevice.GD32E50x_DFP.1.3.0/GigaDevice.GD32E50x_DFP.pdsc
      <!-- ************************  Subfamily 'GD32E507'  **************************** -->
      <subFamily DsubFamily="GD32E507">
        <processor Dclock="180000000"/>
        <description>
        GD32E50x - ARM Cortex-M33 Core
          Frequency up to 180 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 256KB to 512KB
          SRAM size from 96 KB to 128K with HW parity checking
          3KB ISP loader ROM
        </description>
        <!-- *************************  Device 'GD32E507RC'  ***************************** -->
        <device Dname="GD32E507RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E507RE'  ***************************** -->
        <device Dname="GD32E507RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E507VC'  ***************************** -->
        <device Dname="GD32E507VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E507VE'  ***************************** -->
        <device Dname="GD32E507VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E507ZC'  ***************************** -->
        <device Dname="GD32E507ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_256.FLM" start="0x08000000" size="0x040000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

        <!-- *************************  Device 'GD32E507ZE'  ***************************** -->
        <device Dname="GD32E507ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E50x_CL.svd"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'GD32E508'  **************************** -->
      <subFamily DsubFamily="GD32E508">
        <processor Dclock="180000000"/>
        <description>
        GD32E50x - ARM Cortex-M33 Core
          Frequency up to 180 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 256KB to 512KB
          SRAM size from 96 KB to 128K with HW parity checking
          3KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32E508RE'  ***************************** -->
        <device Dname="GD32E508RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E508.svd"/>
        </device>

        <!-- *************************  Device 'GD32E508VE'  ***************************** -->
        <device Dname="GD32E508VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E508.svd"/>
        </device>

        <!-- *************************  Device 'GD32E508ZE'  ***************************** -->
        <device Dname="GD32E508ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E50x_512.FLM" start="0x08000000" size="0x080000" default="1"/>
          <compile header="Device/Include/gd32e50x.h" define="GD32E50x_CL"/>
          <debug svd="SVD/GD32E508.svd"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32E50xHD">
      <description>GigaDevice GD32E50x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32E503*[CE]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32E50xCL">
      <description>GigaDevice GD32E50x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32E50[57]"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

   <!-- Device + CMSIS Conditions -->
    <condition id="GD32E50x CMSIS">
      <description>GigaDevice GD32E50x Devices and CMSIS-CORE</description>
     <accept condition="GD32E50xHD"/>
     <accept condition="GD32E50xCL"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32E50x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="PMU"/>    
    </condition>

    <!-- GD32E50x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32E50x STDPERIPHERALS RCU">
      <description>GigaDevice GD32E50x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32E50x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="RCU"/>
    </condition>

