CommunityGD32Cores/gigadevice-firmware-and-docs/GD32E50x/GD32E50x_AddOn_V1.3.0/GigaDevice.GD32E50x_DFP.1.3.0/GigaDevice.GD32E50x_DFP.pdsc
     <!-- GD32E50x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32E50x STDPERIPHERALS MISC">
      <description>GigaDevice GD32E50x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32E50x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32E50x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32E50x STDPERIPHERALS EVAL">
      <description>GigaDevice GD32E50x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32E50x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="USART"/>
    </condition>
  </conditions>

  <components>
    <!-- GD32E50x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="ADC" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_adc.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="BKP" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Configurable logic array (BKP) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_bkp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_bkp.c" attr="config" version="1.1.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="CAN" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_can.c" attr="config" version="1.0.0" />
        </files>
    </component>
	
   <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="CMP" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Comparator (CMP) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
        </RTE_Components_h>
        <files>
          <!-- CMP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_cmp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_cmp.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="CRC" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_crc.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="CTC" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_ctc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_ctc.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="DAC" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Digital to analog converter (DAC) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_dac.c" attr="config" version="1.1.0" />
        </files>
    </component>
	
   <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="DBG" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_dbg.c" attr="config" version="1.1.0" />
        </files>
  </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="DMA" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_dma.c" attr="config" version="1.1.0" />
        </files>
    </component>

