CommunityGD32Cores/gigadevice-firmware-and-docs/GD32E50x/GD32E50x_AddOn_V1.3.0/GigaDevice.GD32E50x_DFP.1.3.0/GigaDevice.GD32E50x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="ENET" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Ethernet(ENET) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ENET
        </RTE_Components_h>
        <files>
          <!-- ENET flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_enet.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_enet.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="EXTI" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_exti.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="FMC" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_fmc.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="FWDGT" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_fwdgt.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="GPIO" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_gpio.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="SHRTIMER" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Free watchdog timer(SHRTIMER) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SHRTIMER
        </RTE_Components_h>
        <files>
          <!-- SHRTIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_shrtimer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_shrtimer.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="I2C" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_i2c.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="MISC" Cversion="1.1.0" condition="GD32E50x CMSIS">
      <description>MISC driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_misc.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="PMU" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_pmu.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="RCU" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_rcu.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="RTC" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_rtc.c" attr="config" version="1.1.0" />
        </files>
    </component>

