CommunityGD32Cores/gigadevice-firmware-and-docs/GD32E50x/GD32E50x_AddOn_V1.3.0/GigaDevice.GD32E50x_DFP.1.3.0/GigaDevice.GD32E50x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="SDIO" Cversion="1.1.0" condition="GD32E50x CMSIS">
      <description>Secure digital input/output interface(SDIO) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_sdio.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="SPI_I2S" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_spi.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="SQPI" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Serial Qual Paralle Interface (SQPI) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SQPI
        </RTE_Components_h>
        <files>
          <!-- SQPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_sqpi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_sqpi.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="TIMER" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_timer.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="TMU" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Trigonometric math unit (TMU) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMU
        </RTE_Components_h>
        <files>
          <!-- TMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_tmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_tmu.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="USART" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_usart.c" attr="config" version="1.1.0" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E50x_StdPeripherals" Csub="WWDGT" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32E50x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e50x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e50x_wwdgt.c" attr="config" version="1.1.0" />
        </files>
    </component>

    <!-- Utilities GD32E50x -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32E503" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32e503z_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32e503z_eval.c" attr="config" version="1.1.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="EVAL" Csub="GD32E507" Cversion="1.1.0" condition="GD32E50x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32e507z_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32e507z_eval.c" attr="config" version="1.1.0"/>
      </files>
    </component>

    <!-- Config GD32E50x -->
    <component Cclass="Device" Cgroup="GD32E50x_libopt" Cversion="1.1.0" condition="GD32E50x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Template/gd32e50x_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32E50x HD -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="1.1.0" condition="GD32E50xHD">
      <description>System Startup for GigaDevice GD32E50x High Density Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32e50x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32e50x_hd.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32e50x.c"      attr="config" version="1.1.0"/>
      </files>
    </component>

   <!-- Startup GD32E50x  CL-->
    <component Cclass="Device" Cgroup="Startup"  Cversion="1.1.0" condition="GD32E50xCL">
      <description>System Startup for GigaDevice GD32E50x Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32e50x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32e50x_cl.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32e50x.c"      attr="config" version="1.1.0"/>
      </files>
    </component>
  </components>
</package>
